sex = int(input('Введіть свою стать: 1 - чоловік,2 - жінка\n'))
lifestyle = int(input('Виберіть ваш стиль життя: 1 - переважно сидячий стиль, 2 - в міру активний стиль, 3 - спортивний та дуже активний стиль\n'))
dream = int(input('Скільки годин ви спали вночі:\n'))
workout = int(input('Вам потрібні приклади тренувань: 1 - так, 2 - ні\n'))
water = int(input('Яка ваша вага тіла:\n'))
pulse = int(input('Який ваш пульс за 1 хвилину:\n'))
steps = int(input('Введіть потрібну вам кількість кроків і я переведу їх в калорїї\n'))

print('\n🥗🥗Калорії🥗🥗\n')
if lifestyle == 1:
    print('Вам потрібно вживати приблизно 1900-2100 ккал в день')
elif lifestyle == 2:
    print('Вам потрібно вживати приблизно 2100-2300 ккал в день')
elif lifestyle == 3:
    print('Вам потрібно вживати приблизно 2300-2500 ккал в день')
else:
    print('Перевірте введені дані')

print('\n😴😴Сон😴😴\n')
if 0 < dream < 8:
    print('''Вам потрібно спати більше,бо вас можуть спіткати такі загрози: 
• сонливість
• дратівливість
• ослаблення імунітету
• погіршення зору''')
elif  8 <= dream <= 10:
    print('У вас ідеальний сон')
elif dream > 10:
    print('''Вам потрібно спати більше,бо вас можуть спіткати такі загрози:
• головний біль
• запаморочення
• порушення травлення''')
else:
    print('Перевірте введені дані')

print('\n🏋️🏋️Тренування🏋️🏋️\n')
if workout == 1:
    print('''
Кардіо:

Біг: 30-45 хвилин 3-5 разів на тиждень.
Плавання: 30-45 хвилин 3-5 разів на тиждень.
Їзда велосипедом: 30-45 хвилин 3-5 разів на тиждень.
Спортивна ходьба: 45-60 хвилин 3-5 разів на тиждень.
Танці: 30-60 хвилин 3-4 рази на тиждень.

Силові тренування:

2-3 рази на тиждень з фокусом на всі основні групи м'язів.
Використання гантелі або тренажерів 2-3 підходи по 8-12 повторень для кожної вправи.''')

elif workout == 2:
    print(' ')
else:
    print('Перевірте введені дані')

print('\n💧💧Вода💧💧\n')
if water > 0:
    water = water * 30
    print(f'Вам потрібно вживати {water} мл води в день')
else:
    print('Перевірте введені дані')

print('\n💓💓Пульс💓💓\n')
if 0 < pulse < 70:
    print('Раджу перевіритися в лікаря')
elif 70 <= pulse <= 85:
    print('Ваш пульс у нормі')
elif pulse > 85:
    print('Раджу перевіритися в лікаря')
else:
     print('Перевірте введені дані')

print('\n🚶🏿‍🚶🏿Кроки → Калорії ‍🚶🏿‍🚶🏿‍\n')
if steps > 0:
    steps = steps * 0.04
    print(f'Ви витратили {steps} ккал')
else:
    print('Перевірте введені дані')



